package com.ctnphrae.listview

import android.icu.text.CaseMap
import androidx.appcompat.app.AppCompatActivity
import android.os.Bundle
import android.widget.Adapter
import android.widget.ArrayAdapter
import android.widget.Toast
import kotlinx.android.synthetic.main.activity_main.*

class MainActivity : AppCompatActivity() {

    val titleArr = arrayOf("กระแตหางขนนก","เสือปลา","เสือโคร่ง","เสือดาว","นากเล็กเล็บสั้น","หมาจิ้งจอก","หมีควาย","พังพอนธรรมดา","หมีขอ","กวางป่า","แมวดาว","แมวลายหินอ่อน","แมวป่า","สมัน","เก้งร้อง","เลียงผา",
        "กระจง","หมูป่า","วัวแดง","กูปรี","กระต่ายป่า")
    val detailArr = arrayOf("กระแตหางขนนก ตั้งท้องนานประมาณ 45-55 วัน คาดว่าออกลูกครั้งละ 1-4 ตัว ลูกแรกเกิดหนักประมาณ 10 กรัม",
        "เสือปลา มีขน 2 ชั้น ซึ่งพัฒนามาเพื่อหากินกับน้ำโดยเฉพาะ ขนชั้นในสั้นเกรียนและแน่นมากจนน้ำซึมผ่านไม่ได้ ทำให้ตัวของเสือปลาแห้งและช่วยรักษาความอบอุ่นเอาไว้ในขณะที่ลงจับปลาในน้ำ ขนชั้นนอกจะยาวซึ่งเป็นชั้นที่มีลวดลายและมันวาว",
        "เสือโคร่ง ขนาดและน้ำหนักของเสือโคร่งแต่ละพันธุ์มีความแตกต่างกันมาก เสือไซบีเรียตัวผู้มีขนาดใหญ่และแข็งแรงที่สุด มีความยาวลำตัวเกิน 10 ฟุต และหนักกว่า 300 กิโลกรัม ",
        "เสือดาว เสือดาวเต็มวัยตัวเมียในจีนมีน้ำหนักเฉลี่ย 32 กิโลกรัม เสือดาวพันธุ์อามูร์ตัวผู้มีน้ำหนักเฉลี่ย 32-48 กิโลกรัม แต่บางตัวอาจมีน้ำหนักมากถึง 75 กิโลกรัม ตัวเมียมีน้ำหนัก 25-43 กิโลกรัม",
        "นากเล็กเล็บสั้น หนึ่งในนากไม่กี่ชนิดที่มีความเป็นสัตว์สังคม และยังเป็นสัตว์ผัวเดียวเมียเดียว ทั้งตัวผู้และตัวเมียจะช่วยกันเลี้ยงลูก หากินอยู่กันเป็นฝูงครอบครัว ฝูงหนึ่งราว 4-12 ตัว ตัวเมียจะเป็นผู้ปกครองฝูง ส่วนตัวผู้มีหน้าที่หาอาหารและเลี้ยงลูก",
        "หมาจิ้งจอก เป็นสัตว์ผัวเดียวเมียเดียว ในประเทศไทยจะผสมพันธุ์ในราวเดือนมีนาคม ในถิ่นอื่นอาจต่างกันไป",
        "หมีควาย บางตัวย้ายแหล่งหากินตามฤดูกาล ในฤดูร้อนจะย้ายขึ้นไปอาศัยบนที่สูง ส่วนในฤดูหนาวจะลงมาพื้นที่ต่ำกว่า หมีควายที่อาศัยในถิ่นหนาวจะมีพฤติกรรมที่คล้ายกับการจำศีลด้วย",
        "พังพอนธรรมดา ตั้งท้องนาน 49 วัน ออกลูกครอกหนึ่ง 2 ตัว เคยพบมากถึง 5 ตัว ตัวผู้เข้าสู่วัยเจริญพันธุ์เมื่ออายุได้ 4 เดือน",
        "หมีขอ ไม่มีฤดูผสมพันธุ์ที่แน่นอน แต่มักออกลูกในช่วงเดือนกุมภาพันธุ์ถึงเมษายน ตั้งท้องนาน 90-92 วัน ลูกครอกหนึ่งมีราว 2-3 ตัว อายุเฉลี่ยของตัวเมียเมื่อผสมพันธุ์ครั้งแรกและเป็นผลสำเร็จคือ 30.4 เดือน",
        "กวางป่า หากินตอนกลางคืนเป็นส่วนใหญ่ กินใบไม้ ผลไม้ หญ้า หัวพืช ยอดอ่อน ตอนกลางวันจะพักผ่อนอยู่ในป่าทึบ ว่ายน้ำเก่งและชอบแช่ปลัก ตัวผู้ทำสัญลักษณ์บอกอาณาเขตด้วยกลิ่นที่ผลิตจากต่อมกลิ่น",
        "แมวดาว หากินเวลากลางคืนเป็นส่วนใหญ่ แต่ก็พบตอนกลางวันได้บ่อย จากการติดตามแมวดาวด้วยปลอกคอวิทยุในประเทศไทย 4 ตัว พบว่ามีการออกหากินเวลากลางวันบ่อยครั้ง และแต่ละตัวมีช่วงเวลาหากินประจำต่างกันไป",
        "แมวลายหินอ่อน สามารถปรับตัวให้เขากับป่าหลายประเภท ตั้งแต่ป่าเชิงเขาฮิมาลัยจนถึงป่าเขตร้อนในมาเลเซีย ส่วนใหญ่จะพบในป่าร้อนชื้น เนื่องจากแมวลายหินอ่อนมีจำนวนน้อยมาก เราจึงยังไม่ทราบลักษณะของป่าที่แมวลายหินอ่อนชอบที่สุด",
        "แมวป่า สามารถปรับตัวเข้ากับสภาพแวดล้อมได้หลายอย่าง บางครั้งอาจพบได้ใกล้แหล่งอาศัยของมนุษย์ เช่นตามพื้นที่เกษตรกรรมหรือบ้านร้าง",
        "สมัน ตัวเมียไม่มีเขา และลักษณะคล้ายละมั่งมาก ชาวบ้านบางท้องที่จึงมีความเชื่อว่าสมันมีเฉพาะตัวผู้เท่านั้น และเมื่อสมันตัวผู้ผสมพันธุ์กับละมั่งจะให้ลูกเป็นสมันหรือละมั่ง",
        "เก้งร้อง เสียงคล้ายหมาเห่า แต่ดังมาก จนบางคนที่ได้ยินเมื่อเข้าป่าอาจตกใจคิดว่าเป็นหมาป่าได้ ภาษาอังกฤษจึงชื่อเรียกว่าเก้งอีกชื่อหนึ่งว่า barking deer ซึ่งแปลว่า กวางเห่า นั้นเอง",
        "เลียงผา ผสมพันธุ์ในช่วงเดือนตุลาคมถึงพฤศจิกายน แม่เลียงผาตั้งท้องนาน 7 เดือน ออกลูกทีละตัว ลูกเลียงผาอยู่กับแม่เป็นเวลา 1 ปี ตัวเมียเข้าสู่วัยเจริญพันธุ์เมื่ออายุ 30 เดือน ตัวผู้เข้าสู่วัยเจริญพันธุ์เมื่ออายุ 30-36 เดือน มีอายุขัย 10 ปี",
        "กระจง เเป็นสัตว์ขยายพันธุ์เก่ง ตัวเมียแทบจะตั้งท้องตลอดเวลา ตั้งท้องนาน 140-177 วัน และให้กำเนิดลูกได้ 2-3 ตัวต่อ",
        "หมูป่า ในยุโรปอาศัยกันเป็นฝูงขนาดใหญ่ ราว 20 ตัว บางฝูงอาจมีสมาชิกมากถึง 100 ตัว สมาชิกในฝูงประกอบด้วยหมูตัวเมียและหมูเด็ก เมื่อหมูตัวผู้เติบใหญ่ จะแยกตัวออกจากฝูงไปหากินโดยลำพัง",
        "วัวแดง ในประเทศไทยมีฤดูผสมพันธุ์อยู่ในช่วงเดือนพฤษภาคมถึงเดือนมิถุนายน แม่วัวแดงตั้งท้องนาน 285 วัน ออกลูกครั้งละตัว ลูกวัวหย่านมได้เมื่ออายุได้ 6-9 เดือน และจะเข้าสู่วัยเจริญพันธุ์เมื่ออายุได้ 2-3 ปี ในธรรมชาติวัวแดงมีอายุขัย 20 ปี ในแหล่งเพาะเลี้ยงมีอายุได้ถึง 26 ปี",
        "กูปรี พบมีเขตกระจายพันธุ์อยู่ในเทือกเขาพนมดงรัก บริเวณชายแดนไทย-กัมพูชา-ลาว-เวียดนามเท่านั้น อาศัยอยู่ในป่าเปิด ทุ่งหญ้าสลับป่าทึบ คาดว่าในฤดูฝนฝูงกูปรีจะอพยพขึ้นที่สูง",
        "กระต่ายป่า หากินกลางคืน ตั้งแต่พลบค่ำจนถึงรุ่งเช้า อาหารหลักคือหญ้า เปลือกไม้ ออกลูกได้ปีละหลายครอก ออกลูกครั้งละ 1-7 ตัว (เฉลี่ย 3-4 ตัว) ตั้งท้องนานประมาณ 35-40 วัน อายุขัยประมาณ 6 ปี")
    val context = this

    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        setContentView(R.layout.activity_main)
        setTitle("ข้อมูล")
        val mAdapter = ArrayAdapter(context,
            android.R.layout.simple_list_item_1,
            titleArr)

        lv_anime.adapter = mAdapter
        lv_anime.setOnItemClickListener{ parent, view, position, id ->
            Toast.makeText(context,
                "ชื่อ = ${titleArr[position]} , ข้อมูล = ${detailArr[position]}"
                ,Toast.LENGTH_LONG).show()
        }

    }
}
